/* Error message string. The first %@ is the file name, the second the error message */
"Could not extract the file \"%@\": %@" = "Немагчыма выняць файл "%1$@": %2$@";

/* Error message for resource forks. The first %@ is the file name, the second the error message */
"Could not extract the resource fork for the file \"%@\":\n%@" = "Немагчыма выняць галіну рэсурсаў файла "%1$@":\n%2$@";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Вызначаць аўтаматычна";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Распакаваць";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Распакаванне архіва";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Распакоўваю "%@"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Рыхтуюся да распакавання "%@"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Абраць";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Абярыце файлы для распакавання";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Распакаваць";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "Гэта праграма не можа распакаваць архіў "%@".";

/* Error message string when writing is impossible. */
"Could not write to the destination directory." = "Запіс у мэтавую тэчку немагчымая.";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */

/* Common errors */
"Input data buffers border exceeded" = "Адсутнічае частка файла архіва";
"Opening file failed" = "Файл не можа быць адкрыты";
"Missing or wrong password" = "Пароль няправільны";
"Wrong checksum" = "Файл архіва пашкоджаны";
"Could not create directory" = "Немагчыма стварыць тэчку";

/* Uncommon or unused errors */
"Unknown error" = "Невядомая памылка";
"Output data buffers border exceeded" = "Перавышаны памер выходнага буфера";
"Function called with illegal parameters" = "Функцыя выклікана з недапушчальнымі параметрамі";
"Not enough memory available" = "Недастаткова памяці";
"Data is corrupted" = "Дадзеныя пашкоджаны";
"Command is not supported" = "Каманда не падтрымліваецца";
"Required resource missing" = "Адсутнічае неабходны рэсурс";
"Error on decrunching" = "Памылка дэкампрэсіі";
"Unknown file type" = "Невядомы тып файла";
"File, disk has been skipped" = "Файл, дыск прапушчаны";
"User break in progress hook" = "Працэс перапынены карыстачом";
"File already exists" = "Файл ужо існуе";
"Verify failed (disk hook)" = "Памылка пры праверцы";
"Wrong drive geometry" = "Хібныя параметры дыска";
"Unknown data format" = "Невядомы фармат дадзеных";
"Source contains no files" = "Архіў не ўтрымоўвае файлаў";
"Unknown filesystem" = "Невядомая файлавая сістэма";
"Name of file exists as directory" = "Імя файла супадае з імем існай тэчкі";
"Buffer was too short" = "Буфер занадта малы";
"Text encoding was defective" = "Хібная кадоўка";
